In [2]:
import numpy as np
import pandas as pd

In [55]:
repwithinsite = pd.read_csv('MarineReplicateWithInSite.csv')

In [56]:
repwithinsite.head(5)

    SiteID EventDateStart  MarineReserveID  ReplicateWithinSite  PotNumber
0  BNP_006     22/02/2010          2797862                  1.0        4.0
1  BNP_006     22/02/2010          2797862                  2.0        5.0
2  BNP_006     22/02/2010          2797862                  2.0        5.0
3  BNP_006     22/02/2010          2797862                  3.0        6.0
4  BNP_007     22/02/2010          2797862                  1.0       38.0

In [57]:
dfgroup = repwithinsite.groupby(['SiteID', 'EventDateStart', 'MarineReserveID', 'ReplicateWithinSite']).count().reset_index()

In [58]:
dfgroup.head(5)

    SiteID EventDateStart  MarineReserveID  ReplicateWithinSite  PotNumber
0  BNP_001     13/10/2010          2797862                  1.0          1
1  BNP_001     13/10/2010          2797862                  2.0          1
2  BNP_001     13/10/2010          2797862                  3.0          1
3  BNP_001     22/02/2010          2797862                  1.0          6
4  BNP_001     22/02/2010          2797862                  2.0          1

In [59]:
dfgroup.to_excel('ReplicateWithinSite.xlsx')

In [4]:
wrongSeries = pd.read_csv('WrongReplicateWithSiteSeries.csv')

In [5]:
wrongSeries.head()

    SiteID EventDateStart  MarineReserveID  ReplicateWithinSite  PotNumber
0  BNP_005     22/02/2010          2797862                    4       23.0
1  BNP_005     22/02/2010          2797862                    5       24.0
2  BNP_005     22/02/2010          2797862                    5       24.0
3  BNP_005     22/02/2010          2797862                    5       24.0
4  BNP_006      4/12/2013          2797862                    7       16.0

In [6]:
dfwronggroup = wrongSeries.groupby(['SiteID', 'EventDateStart', 'MarineReserveID', 'ReplicateWithinSite']).count().reset_index()

In [7]:
dfwronggroup.head()

    SiteID EventDateStart  MarineReserveID  ReplicateWithinSite  PotNumber
0  BNP_005     22/02/2010          2797862                    4          1
1  BNP_005     22/02/2010          2797862                    5          3
2  BNP_006      4/12/2013          2797862                    1          8
3  BNP_006      4/12/2013          2797862                    2          5
4  BNP_006      4/12/2013          2797862                    3          6

In [8]:
dfwronggroup.to_excel('WrongReplicateWithinSite.xlsx')